Revit 2027 API
Document.GetActiveEditMode Method
 Returns the document's active edit mode. Returns None if no edit mode is currently active.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public EditModeType GetActiveEditMode()
Public Function GetActiveEditMode As EditModeType
public:
EditModeType GetActiveEditMode()
member GetActiveEditMode : unit -> EditModeType
Return Value
EditModeType
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace